Конфигурация/Documents/ВводКредитногоИнструмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВводКредитногоИнструмента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ПроцентыПоКредитнымИнструментам</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ВводыВыводыАктивовВВалютеУчета</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКредитныхИнструментах</xr:Item>
				<xr:Item>InformationRegister.НоминалыКредитныхИнструментов</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПроцентов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПроцентовБУ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПроцентовНУ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоходовБудущихПериодов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКорректировкиПоАмортизированнойСтоимости</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКорректировкиПоАмортизированнойСтоимостиБУ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияПриходаПроцентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПрихода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Частичный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияНоминала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ПериодичностиВыплатыПроцентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПериодичностиВыплатыПроцентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ежемесячно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежеквартально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВКонцеСрока</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Авансом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ВводКредитногоИнструмента/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ_И_ЭЛЕМЕНТОВ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	РасчитатьРыночнуюСтоимостьДепозита();
	РасчитатьСтоимостьДепозитаБУ();
	РасчитатьСтоимостьДепозитаНУ();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьПодтверждениеОперацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	РасчитатьРыночнуюСтоимостьДепозита();
	РасчитатьСтоимостьДепозитаБУ();
	РасчитатьСтоимостьДепозитаНУ();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПроцентовПриИзменении(Элемент)
	
	РасчитатьРыночнуюСтоимостьДепозита();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаКорректировкиПоАСПриИзменении(Элемент)
	
	РасчитатьРыночнуюСтоимостьДепозита();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПроцентовБУПриИзменении(Элемент)
	
	РасчитатьСтоимостьДепозитаБУ();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаКорректировкиПоАмортизированнойСтоимостиБУПриИзменении(Элемент)
	
	РасчитатьСтоимостьДепозитаБУ();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДоходовБудущихПериодовПриИзменении(Элемент)
	
	РасчитатьСтоимостьДепозитаБУ();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПроцентовНУПриИзменении(Элемент)
	
	РасчитатьСтоимостьДепозитаНУ();
		
КонецПроцедуры

&НаКлиенте
Процедура КредитныйИнструментПриИзменении(Элемент)
	
	ЭтаФорма.ПериодичностьВыплатыПроцентов = ПолучитьПериодичностьВыплатыПроцентов(Объект.КредитныйИнструмент, Объект.Дата);
	
	Если ЭтаФорма.ПериодичностьВыплатыПроцентов = ПредопределенноеЗначение("Перечисление.ПериодичностиВыплатыПроцентов.Авансом") Тогда
		Объект.СуммаПроцентовБУ = 0;
	Иначе
		Объект.СуммаДоходовБудущихПериодов = 0;
	КонецЕсли;
	
	РасчитатьСтоимостьДепозитаБУ();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры


#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЭтаФорма.ПериодичностьВыплатыПроцентов = ПолучитьПериодичностьВыплатыПроцентов(Объект.КредитныйИнструмент, Объект.Дата);
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный") Тогда
	
		ЭтаФорма.ТипПередачи = РаботаСДокументами.ПолучитьТипПередачиДляВводаВыводаАктивов(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Контрагент);
		
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры //ПриЧтенииСозданииНаСервере

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы      = Форма.Элементы;
		
	Элементы.СуммаПроцентовБУ.Видимость 			= НЕ (Форма.ПериодичностьВыплатыПроцентов = ПредопределенноеЗначение("Перечисление.ПериодичностиВыплатыПроцентов.Авансом"));
	Элементы.СуммаДоходовБудущихПериодов.Видимость 	= (Форма.ПериодичностьВыплатыПроцентов = ПредопределенноеЗначение("Перечисление.ПериодичностиВыплатыПроцентов.Авансом"));
	
	СобственныйСчетДУ = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбъекта.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный"));

	Элементы.ТипПередачи.Видимость = Не СобственныйСчетДУ;
	Элементы.Контрагент.АвтоОтметкаНезаполненного = РаботаСДокументамиКлиентСервер.ТребуетсяПроверкаЗаполненияЗначенияКонтрагента(ДанныеОбъекта);
	Элементы.Контрагент.ТолькоПросмотр = Форма.ТипПередачи < 2 И Не СобственныйСчетДУ;
	
КонецПроцедуры // НастроитьВидимостьДоступность

&НаСервереБезКонтекста
Функция ПолучитьПериодичностьВыплатыПроцентов(КредитныйИнструмент, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов
		|ИЗ
		|	РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
		|			&Период,
		|			ДатаНачалаДействияУсловий <= &Период
		|				И КредитныйИнструмент = &КредитныйИнструмент) КАК УсловияКредитныхИнструментовСрезПоследних
		|ГДЕ
		|	УсловияКредитныхИнструментовСрезПоследних.Действует
		|
		|УПОРЯДОЧИТЬ ПО
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий УБЫВ";
	
	Запрос.УстановитьПараметр("КредитныйИнструмент"	, КредитныйИнструмент);
	Запрос.УстановитьПараметр("Период"			, Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПериодичностьВыплатыПроцентов;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()
	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьРыночнуюСтоимостьДепозита()
	
	ЭтаФорма.РыночнаяСтоимостьДепозита = Объект.Сумма + Объект.СуммаПроцентов + Объект.СуммаКорректировкиПоАмортизированнойСтоимости;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьСтоимостьДепозитаБУ()
	
	ЭтаФорма.СтоимостьДепозитаБУ = Объект.Сумма + Объект.СуммаПроцентовБУ + Объект.СуммаКорректировкиПоАмортизированнойСтоимостиБУ - Объект.СуммаДоходовБудущихПериодов;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьСтоимостьДепозитаНУ()
	
	ЭтаФорма.СтоимостьДепозитаНУ = Объект.Сумма + Объект.СуммаПроцентовНУ;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный") Тогда
		ЭтаФорма.ТипПередачи = 0;
	КонецЕсли;
	
	Объект.Контрагент = РаботаСДокументамиКлиент.ПолучитьКонтрагентаДляВводаВыводаАктивов(Объект.Дата, ЭтаФорма.ТипПередачи, Объект.Организация, Объект.СчетДоверительногоУправления);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПередачиПриИзменении(Элемент)
	
	Объект.Контрагент = РаботаСДокументамиКлиент.ПолучитьКонтрагентаДляВводаВыводаАктивов(Объект.Дата, ЭтаФорма.ТипПередачи, Объект.Организация, Объект.СчетДоверительногоУправления);
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры


#КонецОбласти
